<a href="https://colab.research.google.com/github/Nate0031/24BCAHH010048-DataOps-Lab/blob/main/DataOps_Lab_Test.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount ('/content/drive')

Mounted at /content/drive

In [13]:
import pandas as pd
df=pd.read_excel('/content/drive/MyDrive/EVEN (1).xlsx')

In [14]:
#Cleaning the database
df=df.dropna()

In [15]:
#Finding the average total cost of trips from each destination
print("unique values in destination column :", df['Destination'].nunique())

Destination
ARUBA                   8573.290
American Samoa         67741.960
Andreaville            22221.660
Andrewshire            55221.440
Anguilla               80593.320
                         ...
West Jessicaborough    85510.880
West Kelly              9908.580
West Timothyburgh      36650.470
Yemen                  47950.685
Zambia                 20658.930
Name: Total_Cost, Length: 258, dtype: float64

In [16]:
#Distribution of Payment Methods used by Customers
df['Payment_Method'].value_counts()

Payment_Method
Bank Transfer    324
Debit Card       319
Credit Card      294
PayPal           291
Name: count, dtype: int64

In [17]:
#How many unique destination present in the dataset
df['Destination'].value_counts()

Destination
Kolkata               144
Hyderabad             142
Chennai               137
Delhi                 136
Mumbai                133
                     ...
FELICIALAND             1
East Kimberlyberg       1
Anthonyland             1
South Tiffanyburgh      1
North Brittneyland      1
Name: count, Length: 258, dtype: int64

In [49]:
#Create a new column that calculates the duration of each trip based on Travel_Dates
df[['Start Date', 'End Date']] = df['Travel_Dates'].str.split(' - ', expand=True)

# Convert to datetime
df['Start Date'] = pd.to_datetime(df['Start Date'])
df['End Date'] = pd.to_datetime(df['End Date'])

# Calculate duration in days
df['Trip_Duration'] = (df['End Date'] - df['Start Date']).dt.days

print(df[['Travel_Dates', 'Trip_Duration']])

ValueError: time data "2024/05/02 / 2025/06/28" doesn't match format "%Y-%m-%d", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [23]:
#Finding any NA values in important columns like Travel_Package,Payment_Methods or Travel_Agent
nan_values = df[['Travel_Package','Travel_Agent','Payment_Method']].isna()
print(nan_values)

      Travel_Package  Travel_Agent  Payment_Method
0              False         False           False
1              False         False           False
15             False         False           False
16             False         False           False
21             False         False           False
...              ...           ...             ...
5237           False         False           False
5238           False         False           False
5239           False         False           False
5240           False         False           False
5247           False         False           False

[1228 rows x 3 columns]

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1228 entries, 0 to 5247
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Booking_ID           1228 non-null   object
 1   Customer_ID          1228 non-null   object
 2   Destination          1228 non-null   object
 3   Travel_Dates         1228 non-null   object
 4   Booking_Date         1228 non-null   datetime64[ns]
 5   Number_of_Travelers  1228 non-null   float64
 6   Travel_Package       1228 non-null   object
 7   Payment_Method       1228 non-null   object
 8   Total_Cost           1228 non-null   float64
 9   Travel_Agent         1228 non-null   object
 10  Customer_Feedback    1228 non-null   object
 11  Start_Date           1228 non-null   object
 12  End_Date             1111 non-null   object
dtypes: datetime64[ns](1), float64(2), object(10)
memory usage: 134.3+ KB